In [2]:
import pandas as pd

In [3]:
data = [["Rahul", 35], ["Abhishek", 55], ["Sohit", 87], ["Harsh", 59]]

In [4]:
data

[['Rahul', 35], ['Abhishek', 55], ['Sohit', 87], ['Harsh', 59]]

In [5]:
pd.DataFrame(data, columns = ["name", "marks"])

       name  marks
0     Rahul     35
1  Abhishek     55
2     Sohit     87
3     Harsh     59

In [6]:
data = {"a": [10,11,23,24], "b": [12,11,245,244], "c": [13,12,78,44]}

In [7]:
data

{'a': [10, 11, 23, 24], 'b': [12, 11, 245, 244], 'c': [13, 12, 78, 44]}

In [8]:
df = pd.DataFrame(data)

In [9]:
df

    a    b   c
0  10   12  13
1  11   11  12
2  23  245  78
3  24  244  44

In [10]:
import numpy as np

In [11]:
arr = np.array([[1,2,4], [6,6,7]])

In [12]:
arr

array([[1, 2, 4],
       [6, 6, 7]])

In [28]:
df = pd.DataFrame(arr, columns = ["A", "B", "C"])

In [29]:
df

   A  B  C
0  1  2  4
1  6  6  7

In [35]:
df = pd.read_excel("../Data/Marks.xlsx")

In [36]:
df

        Name School  Marks
0      Rahul     NR     34
1   Abhishek    VPS     56
2      Sohit    CPV     56
3      Harsh    JPS     66
4      Akash     NR     44
5  Divyanshu    JPS     55
6    Prateek     NR     78
7   UditKant     NR     98
8      Ayush    GPS     90

In [37]:
df = pd.read_csv("../Data/Marks1.csv")

In [38]:
df

        Name School  Marks
0      Rahul     NR     34
1   Abhishek    VPS     56
2      Sohit    CPV     56
3      Harsh    JPS     66
4      Akash     NR     44
5  Divyanshu    JPS     55
6    Prateek     NR     78
7   UditKant     NR     98
8      Ayush    GPS     90

df = pd.read_json("data.json")

for json files

In [39]:
url = "https://raw.githubusercontent.com/mwaskom/seaborn-data/master/tips.csv"
df = pd.read_csv(url)

In [40]:
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

EDA (Exploratory Data Analysis)
Exploratory Data Analysis (EDA) is an essential first step in any data science project.

It involves taking a deep look at the dataset to understand its structure, spot patterns, identify anomalies, and uncover relationships between variables. This process includes generating summary statistics, checking for missing or duplicate data, and creating visualizations like histograms, box plots, and scatter plots. The goal of EDA is to get a clear picture of what the data is telling you before applying any analysis or machine learning models.

By exploring the data thoroughly, you can make better decisions about how to clean, transform, and model it effectively.

Once your DataFrame is ready, run these to understand your data:

df.head()         # First 5 rows
df.tail()         # Last 5 rows
df.info()         # Column info: types, non-nulls
df.describe()     # Stats for numeric columns
df.columns        # List of column names
df.shape          # (rows, columns)

In [48]:
df.head()         # First 5 rows

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [50]:
df.tail()         # Last 5 rows

     total_bill   tip     sex smoker   day    time  size
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

In [51]:
df.info()         # Column info: types, non-nulls

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    object
 3   smoker      244 non-null    object
 4   day         244 non-null    object
 5   time        244 non-null    object
 6   size        244 non-null    int64
dtypes: float64(2), int64(1), object(4)
memory usage: 13.5+ KB

In [52]:
df.describe()     # Stats for numeric columns

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

In [53]:
df.columns        # List of column names

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

In [54]:
df.shape          # (rows, columns)

(244, 7)